### Missing Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna()  #By default operation happens along the row

     A    B  C
0  1.0  5.0  1

In [6]:
df.dropna(axis=1)  #it will drop col with null value

   C
0  1
1  2
2  3

In [8]:
df.dropna(thresh=2)     #at least 2 non NA values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [9]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
#Filling Missing Values

In [11]:
df.fillna(value='Fill Value')

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [12]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64